calugo/OpenPlant-Electrophysiology/arduino-1.6.0-Engduino/hardware/Engduino/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

Engduinov3.name=EngduinoV3

Engduinov3.upload.tool=avrdude
Engduinov3.upload.protocol=avr109
Engduinov3.upload.maximum_size=28672
Engduinov3.upload.maximum_data_size=2560
Engduinov3.upload.speed=57600
Engduinov3.upload.disable_flushing=true
Engduinov3.upload.use_1200bps_touch=true
Engduinov3.upload.wait_for_upload_port=true

Engduinov3.bootloader.tool=avrdude
Engduinov3.bootloader.low_fuses=0xff
Engduinov3.bootloader.high_fuses=0xd8
Engduinov3.bootloader.extended_fuses=0xce
Engduinov3.bootloader.file=caterina-LilyPadUSB/Caterina-LilyPadUSB.hex
Engduinov3.bootloader.unlock_bits=0x3F
Engduinov3.bootloader.lock_bits=0x2F

Engduinov3.build.mcu=atmega32u4
Engduinov3.build.f_cpu=8000000L
Engduinov3.build.vid=0x1B4F
Engduinov3.build.pid=0x9208
Engduinov3.build.usb_product="LilyPad USB"
Engduinov3.build.board=AVR_LILYPAD_USB
Engduinov3.build.core=arduino
Engduinov3.build.variant=engduinov3
Engduinov3.build.extra_flags={build.usb_flags}

##############################################################

Engduinov2.name=EngduinoV2

Engduinov2.upload.tool=avrdude
Engduinov2.upload.protocol=avr109
Engduinov2.upload.maximum_size=28672
Engduinov2.upload.maximum_data_size=2560
Engduinov2.upload.speed=57600
Engduinov2.upload.disable_flushing=true
Engduinov2.upload.use_1200bps_touch=true
Engduinov2.upload.wait_for_upload_port=true

Engduinov2.bootloader.tool=avrdude
Engduinov2.bootloader.low_fuses=0xff
Engduinov2.bootloader.high_fuses=0xd8
Engduinov2.bootloader.extended_fuses=0xce
Engduinov2.bootloader.file=caterina-LilyPadUSB/Caterina-LilyPadUSB.hex
Engduinov2.bootloader.unlock_bits=0x3F
Engduinov2.bootloader.lock_bits=0x2F

Engduinov2.build.mcu=atmega32u4
Engduinov2.build.f_cpu=8000000L
Engduinov2.build.vid=0x1B4F
Engduinov2.build.pid=0x9208
Engduinov2.build.usb_product="LilyPad USB"
Engduinov2.build.board=AVR_LILYPAD_USB
Engduinov2.build.core=arduino
Engduinov2.build.variant=engduinov2
Engduinov2.build.extra_flags={build.usb_flags}

##############################################################

Engduinov1.name=EngduinoV1

Engduinov1.upload.tool=avrdude
Engduinov1.upload.protocol=avr109
Engduinov1.upload.maximum_size=28672
Engduinov1.upload.maximum_data_size=2560
Engduinov1.upload.speed=57600
Engduinov1.upload.disable_flushing=true
Engduinov1.upload.use_1200bps_touch=true
Engduinov1.upload.wait_for_upload_port=true

Engduinov1.bootloader.tool=avrdude
Engduinov1.bootloader.low_fuses=0xff
Engduinov1.bootloader.high_fuses=0xd8
Engduinov1.bootloader.extended_fuses=0xce
Engduinov1.bootloader.file=caterina-LilyPadUSB/Caterina-LilyPadUSB.hex
Engduinov1.bootloader.unlock_bits=0x3F
Engduinov1.bootloader.lock_bits=0x2F

Engduinov1.build.mcu=atmega32u4
Engduinov1.build.f_cpu=8000000L
Engduinov1.build.vid=0x1B4F
Engduinov1.build.pid=0x9208
Engduinov1.build.usb_product="LilyPad USB"
Engduinov1.build.board=AVR_LILYPAD_USB
Engduinov1.build.core=arduino
Engduinov1.build.variant=engduinov1
Engduinov1.build.extra_flags={build.usb_flags}
